# 1: მისალმება სახელით
# მომხმარებელი შეჰყავს თავისი სახელი, პროგრამა კი აბრუნებს მისალმებას მისალმება-"hello user" და დაბლა დაპრინტეთ შეყვანილი სახელი

input("sandro")

print("hello" + " user")

print(input)

# 2: ახსენი რა არის Input და output

#input არის ფუნქცია რომლის დროსაც მომხმარებელს ვუსვავთ კითხვას () ის შიგნით str-ის სახით
#output არის როდესაც დასმული კითხვა გამოდის ტერმინალში იგივე output-ში

# 3: ერთი და იგივე ტექსტის გამეორება
# მომხმარებელი შეჰყავს სიტყვა და პროგრამა ორჯერ ბეჭდავს მას.

name = "რა გქვია"

print(name, name)


# 4: პასუხი
# მომხმარებელი შეჰყავს რაიმე, მაგრამ პროგრამა პასუხობს ერთი და იგივე ფრაზით მაგალითად"გასაგებია".

inputExample = input("გასაგებია თუ არა?: ")

print(inputExample)

print("გასაგებია")

# 5 გაიარეთ SoloLearn: