# ეს ცვლადი ინახავს ჩემი სახელის მნიშვნელობას
name = "sandro"
# თუ დააჭერ ctrl da / შეგილია ტექსტი ჩასვა კომენტარში




#=======================================================================================================================
# 1) შევეკითოთ მომხარებელს, ღირს თუ არა 2 მონიტორის ყიდვა ?

#user არის მომხარებელი

# 2) ᲛᲝᲛᲮᲐᲠᲔᲑᲔᲚᲡ ᲨᲔᲔᲙᲘᲗᲮᲔᲗ "ᲛᲣᲨᲐᲝᲑᲡ ᲗᲣ ᲐᲠᲐ ᲩᲔᲛᲘ ᲛᲐᲪᲘᲕᲐᲠᲘ"
#  1) ᲞᲐᲡᲣᲮᲘ ᲒᲐᲛᲝᲘᲢᲐᲜᲔᲗ ᲢᲔᲠᲛᲘᲜᲐᲚᲨᲘ
#  2) ᲒᲐᲜᲕᲐᲐᲮᲚᲝᲗ ᲪᲕᲚᲐᲓᲘ ᲠᲝᲛᲔᲚᲨᲘᲪ ᲘᲜᲐᲮᲔᲑᲝᲓᲐ INPUT ᲘᲡ ᲛᲜᲘᲨᲜᲕᲜᲔᲚᲝᲑᲐ ᲓᲐ ᲒᲕᲐᲥᲪᲘOᲗ 444  
#  3) ᲡᲐᲑᲝᲚᲝᲝᲓ ᲔᲡ ᲪᲕᲚᲐᲓᲘ ᲒᲐᲛᲝᲘᲢᲐᲜᲢ ᲢᲔᲠᲛᲘᲜᲐᲚᲨᲘ

age = input(" მუშაობს თუ არა ჩემი მაცივარი: ")
#update 
age = 444 
name = "davit"
print (name, age)

 
