# 1. "გმირის ინვენტარი" (RPG Game Inventory)
# შექმენი ლექსიკონი hero, სადაც გექნება გასაღებები: name, level, და items (ეს უკანასკნელი უნდა იყოს სია/list).
hero = {
    "name":"sandro",
    "level":57,
    "items":["rpg","mp5","smg","m39"]
}

#დაამატე ახალი იარაღი სიაში items
hero["items"].append("ak47")
_list = hero["items"]
print(_list)

print("---------------------------------------------------------------")

#გაზარდე გმირის level 1-ით.
hero["level"] += 1
print(hero["level"])
print("---------------------------------------------------------------")
#დაბეჭდე მთლიანი ლექსიკონი ისე, რომ გამოჩნდეს გმირის განახლებული სტატისტიკა.
print(hero)

#2. "სოციალური მედიის პროფილი"
# შექმენი ლექსიკონი user_profile, სადაც იქნება ინფორმაცია მომხმარებელზე (სახელი, გვარი, ასაკი, ჰობი).
user_profie = {
    "name":"sandro",
    "surname":"miqelashvili",
    "age":14,
    "hoby":["basketball", "programming"]
}

#მომხმარებელმა შეიცვალა სახელი — განაახლე name გასაღები.
#update
user_profie["name"] = "aleqsandre"

#წაშალე age გასაღები ლექსიკონიდან (კონფიდენციალურობის გამო).
del user_profie["age"]
print("---------------------------------------------------------------")
#დაბეჭდე მხოლოდ ლექსიკონის მნიშვნელობები (values) for ციკლის გამოყენებით.
for value in user_profie:
    print(user_profie[value])

print("---------------------------------------------------------------")

# 3. "ონლაინ მაღაზიის კალათა"
# შექმენი ლექსიკონი cart, სადაც გასაღები იქნება პროდუქტის სახელი, ხოლო მნიშვნელობა — მისი ფასი.
cart = {
    "bannana":15,
    "apple":60,
    "ak47":1364
}
#გამოიყენე for ციკლი, რომ დაითვალო კალათაში არსებული ყველა ნივთის ფასების ჯამი.
def sum_prices(cart):
    res = 0
    for i in cart:
        res += cart[i]
    return res
print(sum_prices({"bannana":15, "apple":60, "ak47":1364}))
print("---------------------------------------------------------------")
#4. "ქვეყნები და დედაქალაქები" (Quiz-ის საფუძველი)
# შექმენი ლექსიკონი 5 ქვეყნითა და მათი დედაქალაქებით.
countries_cities = {
    "georgia":"tbilisi",
    "france":"paris",
    "russia":"moscow",
    "germany":"berlin",
}
#დაწერე კოდი, რომელიც მომხმარებელს შეეკითხება ქვეყნის სახელს (input()).
ask = input("enter country name: ")
#თუ ეს ქვეყანა ლექსიკონშია, პროგრამამ უნდა დაბეჭდოს მისი დედაქალაქი.
if ask in countries_cities:
    print(countries_cities[ask])
else:
    print("informacia ver moizebna")
print("---------------------------------------------------------------")
#თუ არ არის, დაბეჭდოს შეტყობინება: "ინფორმაცია ვერ მოიძებნა".

# 5. "კლასის ჟურნალი"
# შექმენი ლექსიკონი students, სადაც გასაღები სტუდენტის სახელია, ხოლო მნიშვნელობა — მისი ნიშნების სია (მაგალითად: [9, 8, 10]).
students = {
    "sandro":[8,9,10],
}

#დაამატე ახალი სტუდენტი თავისი ნიშნებით.
students["aleqsandre"] = [9,10,10]
print(students)
print("---------------------------------------------------------------")
# for ციკლის გამოყენებით დაბეჭდე თითოეული სტუდენტის სახელი და მისი საშუალო ნიშანი (საშუალოს გამოსათვლელად გამოიყენე sum() / len()).
for i in students:
    print(i,sum(students[i]) // len(students[i]))