#შექმენით ერთი ფუქნცია რომელსაც შეუძლია კვადრატში აყვანა ელემენტის
#მას უნდა გადეცეს 1 პარამეტრი

#def power(x):

#შექმენით კალკულატორის ფუქნცია რომელსაც უნდა გადაეცეს 2 არგუმენტი 1 უნდა იყოს ფუქნცია და მეორე უნდა იყოს ციფრი
#def calc(func, x):

#გამოიყენეთ power ფუნქცია  და გადეცით calc ს პირველ პარამეტრად ხოლო calc მა უნდა დაბრუნოს კვადრატში აყვანილი ციფრი ანუ x

def power(x):
    return x**2
def calc(func, x):
    return func(x)
x = calc(power,4)
print(x)
print(list(filter(lambda n: n if n % 2 == 0 else None, [1, 2, 3, 4, 5])))
